<?php

namespace Salabun;

use Salabun\Forms;

/**
 *  Опис помилок, які можуть виникати під час генерації форм
 */

class FormBuilderErrors
{
    /**
     *  Перелік помилок:
     */
    static $errors = [
        10 => 'Хибне значення параметру debug! Встановлюю по-дефолту true. Доступні значання: true, false.',
        
        21 => 'Не вказано параметр creating_method! Встановлюю по-дефолту HTML. Доступні значання: HTML, PHP, Blade.',
        22 => 'Хибне значення параметру creating_method! Встановлюю по-дефолту HTML. Доступні значання: HTML, PHP, Blade.',
        
        30 => 'У вхідних параметрах передано зайвий параметр: ',
        31 => 'Відсутній обов\'язковий параметр: ',
        32 => 'Відсутній додатковий параметр: ',
        
        100 => 'Хибне значення обов\'язкового параметру name.',
        101 => 'Хибне значення обов\'язкового параметру id.',
        102 => 'Хибне значення обов\'язкового параметру selected_value. Доступні значення: строка, число, або null.',
        103 => 'Хибне значення додаткового параметру label. Доступні значення: строка, число, або null.',
        104 => 'Хибне значення додаткового параметру class. Доступні значення: строка або null.',
        105 => 'Хибне значення додаткового параметру required. Доступні значення: true або false.',
        106 => 'Хибне значення додаткового параметру values. Доступні значення: масив ["id" => "value"].',
        
        500 => 'Невідомий код помилки.',
    ];
    
    /**
     *  Отримати текст помилки:
     */
	public static function error($int) 
	{
        if(array_key_exists($int, self::$errors)) {
            return self::$errors[$int];
        } else {
            return self::$errors[500];
        }
	}
    
}